<?php
echo ("Завдання 1. Парайко Андрій 251ЕК")."\n";

$a = 15;
$b = 3;
$c = 10;

echo ("Додавання і віднімання")."\n";
echo ($a + $b + $c)."\n";
echo ($a + $b - $c)."\n";
echo ($a - $b + $c)."\n";
echo ($a - $b - $c)."\n";

echo ("Множення і ділення")."\n";
echo ($a * $b * $c)."\n";
echo ($a * $b / $c)."\n";
echo ($a / $b * $c)."\n";
echo ($a / $b / $c)."\n";

echo ("Ділення по модулю та Зведення в ступінь")."\n";
echo ($a % $b % $c)."\n";
echo ($a % $b ** $c)."\n";
echo ($a ** $b % $c)."\n";
echo ($a ** $b ** $c)."\n";
